HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionSimpleFoam/multiRegionHeaterRadiation/system/topAir/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

boundary
{
    ".*"
    {
        inGroups        2(wall viewFactorWall);
    }
    ".*_to_.*"
    {
        sampleMode      nearestPatchFace;
    }
}

U
{
    internalField   uniform (0.1 0 0);
    boundaryField
    {
        ".*"
        {
            type            fixedValue;
            value           uniform (0 0 0);
        }
        minX
        {
            type            fixedValue;
            value           uniform (0.1 0 0);
        }
        maxX
        {
            type            inletOutlet;
            inletValue      uniform (0 0 0);
            value           uniform (0.1 0 0);
        }
    }
}

T
{
    internalField   uniform 300;
    boundaryField
    {
        ".*"
        {
            type            zeroGradient;
        }

        minX
        {
            type            fixedValue;
            value           uniform 300;
        }
        maxX
        {
            type            inletOutlet;
            inletValue      uniform 300;
            value           uniform 300;
        }

        "topAir_to_.*"
        {
            type            turbulentTemperatureRadCoupledMixed;
            Tnbr            T;
            kappaMethod     fluidThermo;
            QrNbr           none;
            Qr              Qr;
            value           uniform 300;
        }
    }
}

epsilon
{
    internalField   uniform 0.01;
    boundaryField
    {
        ".*"
        {
            type            epsilonWallFunction;
            value           uniform 0.01;
        }

        minX
        {
            type            fixedValue;
            value           uniform 0.01;
        }
        maxX
        {
            type            inletOutlet;
            inletValue      uniform 0.01;
            value           uniform 0.01;
        }
    }
}

k
{
    internalField   uniform 0.1;
    boundaryField
    {
        ".*"
        {
            type            kqRWallFunction;
            value           uniform 0.1;
        }

        minX
        {
            type            fixedValue;
            value           uniform 0.1;
        }
        maxX
        {
            type            inletOutlet;
            inletValue      uniform 0.1;
            value           uniform 0.1;
        }
    }
}

p_rgh
{
    internalField   uniform 1e5;
    boundaryField
    {
        ".*"
        {
            type            fixedFluxPressure;
            value           uniform 1e5;
        }

        maxX
        {
            type            fixedValue;
            value           uniform 1e5;
        }
    }
}

p
{
    internalField   uniform 1e5;
    boundaryField
    {
        ".*"
        {
            type            calculated;
            value           uniform 1e5;
        }

        maxX
        {
            type            calculated;
            value           uniform 1e5;
        }
    }
}

Qr
{
    internalField   uniform 0;
    boundaryField
    {
        ".*"
        {
            type            greyDiffusiveRadiationViewFactor;
            qro             uniform 0;
            emissivity      uniform 1.0;
            value           uniform 0;
        }

        "topAir_to_.*"
        {
            type            greyDiffusiveRadiationViewFactor;
            qro             uniform 0;
            value           uniform 0;
        }
    }
}

G
{
    internalField   uniform 0;
    boundaryField
    {
        ".*"
        {
            type            MarshakRadiation;
            emissivity      uniform 1.0;
            value           uniform 0;
        }

        "topAir_to_.*"
        {
            type            MarshakRadiation;
            value           uniform 0;
        }
    }
}

IDefault
{
    internalField   uniform 0;
    boundaryField
    {
        ".*"
        {
            type            greyDiffusiveRadiation;
            emissivity      uniform 1.0;
            value           uniform 0;
        }

        "topAir_to_.*"
        {
            type            greyDiffusiveRadiation;
            value           uniform 0;
        }
    }
}

// ************************************************************************* //
