HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionSimpleFoam/multiRegionHeaterRadiation/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions


# Setup case
./Allrun.pre


#-- Run on single processor

# Agglomerate patch faces
for i in bottomAir topAir
do
    runApplication -s $i \
        faceAgglomerate -region $i -dict constant/viewFactorsDict
done

# Generate view factors
for i in bottomAir topAir
do
    runApplication -s $i \
        viewFactorsGen -region $i
done

runApplication $(getApplication)

echo
echo "creating files for paraview post-processing"
echo
paraFoam -touchAll

#------------------------------------------------------------------------------
